#!/user/bin/python3
#coding=utf-8

#列表list运算的相关笔记
#List:即为写在方括号之间，用逗号分隔开的列表。
'''
    >>> a = ['hello','eggs',100,99]
    >>> a
    ['hello', 'eggs', 100, 99]
    >>> squares = [1,3,4,6,33,44]
    >>> squares
    [1, 3, 4, 6, 33, 44]
'''
# 1、list可以被索引和切片,如下例所示
'''
    >>> squares = [1,3,4,6,33,44]
    >>> squares
    [1, 3, 4, 6, 33, 44]
    >>> squares[0]      #索引返回指定的列表项
    1
    >>> squares[-1]
    44
    >>> squares[-3:]    #切割列表并返回新的列表
    [6, 33, 44]
'''
# 2、所有的分割操作返回一个包含有所需元素的新列表，在下例中，分割将返回列表squares的一个拷贝；
'''    
    >>> squares[:]
    [1, 3, 4, 6, 33, 44]
'''
# 3、列表支持拼接操作，如下所示。
'''
    >>> squares + [77,121,222,66,43]
    [1, 3, 4, 6, 33, 44, 77, 121, 222, 66, 43]
'''
# 4、python 字符串是固定的，列表可以改变其中的元素
'''
    >>> cubes = [1, 2, 3, 6, 18]
    >>> cubes[4] = 19   #将列表中的18换为19
    >>> cubes
    [1, 2, 3, 6, 19]
'''
# 5、可以使用append()方法在列表的末尾增加新项
'''
    >>> cubes.append(200)
    >>> cubes
    [1, 2, 3, 6, 19, 200]   
'''
# 6、可以修改指定区间的值，下例：新建列表letter，再将列表中小写d、e修改为大写D、E
'''
    >>> letter = ['a', 'b', 'c', 'd', 'e', 'f', 'g']
    >>> letter
    ['a', 'b', 'c', 'd', 'e', 'f', 'g']
    >>> letter[3:5]=['D', 'E']  
    >>> letter
    ['a', 'b', 'c', 'D', 'E', 'f', 'g']
'''
# 7、可以移除值，下例：将列表letter大写的D、E清除
'''
    >>> letter[3:5]=[]
    >>> letter
    ['a', 'b', 'c', 'f', 'g']
'''
# 8、清除列表letter
'''
    >>> letter[:] = []
    >>> letter
    []
'''
# 9、内置函数len()用于统计列表
'''
    >>> letter=['dee', 'aa', 'bb']
    >>> len(letter)
    3
'''
# 10、可以使用嵌套列表，（在列表中创建其他列表），例如：
'''
    >>> a = ['a', 'b', 'c']
    >>> n = [1, 2, 3]
    >>> x = [a, n]
    >>> x
    [['a', 'b', 'c'], [1, 2, 3]]
    >>> x[0]
    ['a', 'b', 'c']
    >>> x[0][1]
    'b'
'''