#!/user/bin/python3
#coding=utf-8

#数字运算的相关笔记

'''
python解释器可以作为一个简单的计算器，可以在解释器中输入一个表达式，它将输入表达式的值
>>> 2 + 2
4
>>> 50 - 5 * 6
20
>>> (50 - 5 * 6) / 4
5.0
>>> 8 / 5
1.6
>>> 17 / 3
5.666666666666667
>>> 17 // 3
5
>>> 17 % 3
2
>>> 5 * 3 + 2
17
>>> width = 20
>>> height = 5*9
>>> width * height
900
>>> 5 ** 2
25
>>> 2 ** 7
128
>>> n
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
NameError: name 'n' is not defined
>>> 3 * 3.75 / 1.5
7.5
>>> 7.0 / 2
3.5
>>> tax = 12.5 / 100
>>> price = 100.50
>>> price * tax
12.5625
>>> price + _           #在这里_ 变量应被用户视为只读变量。不要显式地给它赋值——这样您将会创建一个具有相同名称的独立的本地变量，并且屏蔽了这个内置变量的功能。
113.0625                #12.5625+12.5/100+100.5=113.0625
>>> round(_, 2)
113.06
'''