#!/user/bin/python3
#coding=utf-8

#这个案例为python赋值运算符的操作

#给变量abc赋值
a = 21
b = 10
c = 0

'''运算符=：简单的赋值运算符'''	
c = a + b   #将a+b的运算结果赋值为 c
print("1、c的值为：", c)

'''运算符+=：加法赋值运算符'''
c += a      #等效于c=c+a
print("2、c的值为：", c)

'''运算符-=：减法赋值运算符'''
c -= a      #等效于c=c-a
print("3、c的值为：", c)

'''运算符*=：乘法赋值运算符'''
c *= a      #等效于c=c*a
print("4、c的值为：", c)

'''运算符/=：除法赋值运算符'''
c /= a      #等效于c=c/a
print("5、c的值为：", c)

'''运算符%=：取模（求余）赋值运算符'''
c = 2       #重新修改变量c
c %= a      #等效于c=c%a
print("6、c的值为：", c)

'''运算符**=：幂赋值运算符'''
c **= a      #等效于c=c**a
print("7、c的值为：", c)

'''运算符//=：取整除赋值运算符'''
c //= a      #等效于c=c//a
print("8、c的值为：", c)
