#!/user/bin/python3
#coding=utf-8

#这个案例为python运算符优先级的操作

#基本概念
'''
运算符** :指数（最高优先级）
运算符~ + - :按位翻转
运算符* / % // :乘 除 取模和取整除
运算符+ - :加法 减法
运算符>> << :右移左移
运算符& :位“AND”
运算符^ | :位运算符
运算符< <= > >= :小于 小于等于  大于  大于等于比较运算符
运算符<> == != :等于运算符
运算符= %= /= //= += -= *= **= ：赋值运算符
运算符is (is not):身份运算符
运算符in (in not):成员运算符
运算符not and or:逻辑运算符

'''

#实例

a = 20
b = 10
c = 15
d = 5
e = 0

e = (a + b) * c / d
print("(a + b) * c / d的结果为：", e)

e = ((a + b) * c) / d
print("((a + b) * c) / d的结果为：", e)

e = (a + b) * (c / d)
print("(a + b) * (c / d)的结果为：", e)

e = a + b * c / d
print("a + b * c / d的结果为：", e)
